setwd("D:/R/scripts")
library(dplyr)
library(lubridate)
library(openxlsx)


# Импорт таблицы-справочника из редаты
library(readxl)
abons <- read_excel("D:/R/scripts/АБОНЕНТЫ (5)15.xls", 
                    sheet = "ABON11+ABON00", col_types = c("numeric", 
                                                           "numeric", "numeric", "text", "text", 
                                                           "numeric", "text", "numeric", "text", 
                                                           "text", "text", "text", "text", "text", 
                                                           "text", "text", "text", "text", "text", 
                                                           "text", "text", "text", "text", "numeric", 
                                                           "numeric", "numeric", "numeric", 
                                                           "numeric", "numeric", "numeric", 
                                                           "numeric", "numeric", "numeric", 
                                                           "numeric", "numeric", "numeric", 
                                                           "numeric", "numeric", "text", "date", 
                                                           "date", "date", "text", "numeric", 
                                                           "text", "text", "text", "text", "text", 
                                                           "text", "text", "numeric", "text", 
                                                           "text"))
abons <- as_data_frame(abons)

gisadresa <- read_excel("D:/R/scripts/Гис адреса.xlsx")
gisadresa <- as_data_frame(gisadresa)
reqs <- read_excel("D:/R/scripts/reqs.xlsx", 
                   col_types = c("numeric", "text", "text", 
                                 "text", "text", "text", "text", "text", 
                                 "text", "text"))
reqs <- as_data_frame(reqs)
reqs$ДатаЗаключения <- gsub( "0:00:00", "", reqs$ДатаЗаключения)
reqs$ДатаЗаключения <- gsub("[[:space:]]*$","", reqs$ДатаЗаключения)

# Отбор объектов РЦ ЮО
RCUO_objs <- abons %>%
  select(DCODE:RKZ)%>%
  filter(RKZ == "U")
    View(RCUO_objs)
    
#Нагрузка на отопление        
sumnagrotop <- RCUO_objs %>%
      select(DCODE, NOTOPP, DATEIN) %>%
      group_by(DCODE) %>%
      summarise(SUM = sum(NOTOPP))%>%
      mutate("Коммунальная услуга" = "Отопление", "Коммунальный ресурс" = "Тепловая энергия", "Код единицы измерения" = "238", "Режим подачи" = "24",
             "DATEOUT" = "31.12.2030")

#Нагрузка на ГВС
sumnagrgvs <- RCUO_objs %>%
  select(DCODE, NVODP) %>%
  group_by(DCODE) %>%
  summarise(SUM = sum(NVODP)) %>%
  mutate("Коммунальная услуга" = "Горячее водоснабжение", "Коммунальный ресурс" = "Тепловая энергия", "Код единицы измерения" = "238", "Режим подачи" = "24",
         "DATEOUT" = "31.12.2030")

#Нагрузка на ГВС м3
sumnagrgvsm3 <- RCUO_objs %>%
  select(DCODE, NAGRVOD) %>%
  group_by(DCODE) %>%
  summarise(SUM = sum(NAGRVOD)) %>%
  mutate("Коммунальная услуга" = "Горячее водоснабжение", "Коммунальный ресурс" = "Теплоноситель", "Код единицы измерения" = "113", "Режим подачи" = "24",
         "DATEOUT" = "31.12.2030")

# Суммарная нагрузка в разрезе договоров РЦ ЮО. Предметы договоров в шаблоне для ГИС ЖКХ.
RCUO_objs <- as_data_frame(RCUO_objs)

# даты договоров
RCUO_objs$DATEIN <-  as.character(RCUO_objs$DATEIN)
dogdates <-  RCUO_objs %>%
  select(DCODE, DATEIN)%>%
  distinct(DCODE, .keep_all = TRUE)


#объединяем 3 таблицы в одну
binded <- as_data_frame(rbind(sumnagrotop, sumnagrgvs, sumnagrgvsm3))
GIS_PAGE_2 <- merge(binded, reqs[ ,c("Ссылка", "ДатаЗаключения")], by.x = "DCODE", by.y = "Ссылка", all.x = TRUE)
GIS_PAGE_2 <- as_data_frame(GIS_PAGE_2)
GIS_PAGE_2 <- GIS_PAGE_2[c("DCODE",
                           "Коммунальная услуга",
                           "Коммунальный ресурс",
                           "ДатаЗаключения",
                           "DATEOUT",
                           "SUM",
                           "Код единицы измерения",
                           "Режим подачи")]

######################################################################################################
####################
######################################################################################################

# Страница "Объекты жилищного фонда"

# Договор + дом + код

DogDom <- RCUO_objs %>%
  filter(HOUSE == "Жилой фонд") %>%
  select(DCODE, ADDRESS) %>%
  mutate("Тип дома" = "МКД")
  arrange(DCODE)

GIS_PAGE_3 <- merge(DogDom, gisadresa, by.x = "ADDRESS", by.y = "Adress", all.x = TRUE)
GIS_PAGE_3 <- GIS_PAGE_3[c("DCODE","Тип дома", "ADDRESS", "Code")]
GIS_PAGE_3 <- as_data_frame(GIS_PAGE_3)

# Проверка пустых ячеек
test <-  GIS_PAGE_3 %>%
  select(DCODE, ADDRESS, Code) %>%
  filter(is.na(Code))

######################################################################################################
####################
######################################################################################################

# Страница "Договоры ресурсоснабжения"

# Отбираем договоры
GIS_PAGE_1 <-  RCUO_objs %>%
  select(DCODE) %>%
  distinct(DCODE, .keep_all = TRUE) %>%
  mutate("Договор" = DCODE, 
         "Договор на бумаге?" = "да", 
         "Дата окончания действия" = "31.12.2030", 
         "Вторая сторона договора" = "Управляющая организация", 
         "Тип лица" = "Юридическое лицо",
         "Фамилия" = "",
         "Имя" = "",
         "Отчество" = "",
         "Пол" = "",
         "Дата Рождения" = "",
         "СНИЛС" = "",
         "Вид документа" = "",
         "Номер документа" = "",
         "Серия документа" = "",
         "Дата выдачи" = "",
         "Срок выставления" = "5", 
         "Тип срока выставления" = "следующего месяца за расчетным", 
         "Срок внесения платы" = "20", 
         "Тип срока платы" = "следующего месяца за расчетным", 
         "Срок информации о платежах" = "21", 
         "Тип срока о платежах" = "следующего месяца за расчетным", 
         "Дата начала сдачи показаний ПУ" = "23", 
         "Следующего месяца?(начало)" = "нет", 
         "Дата окончания сдачи показаний ПУ" = "25", 
         "Следующего месяца?(конец)" = "нет", 
         "Основание заключения" = "Решение собрания собственников", 
         "Коммерческий учет осуществляет" = "",
         "Показатели качества КР" = "В разрезе договора", 
         "Объемы в договоре ?" = "да",
         "Коммерческий учет ресурса осуществляет" = "Исполнитель коммунальных услуг"
         )
GIS_PAGE_1 <- merge(GIS_PAGE_1, reqs[ ,c("Ссылка", "ДатаЗаключения", "ИдентификаторГИС", "ИНН", "ОГРН", "КПП")], by.x = "DCODE", by.y = "Ссылка", all.x = TRUE)
GIS_PAGE_1$'Дата вступления в силу' = GIS_PAGE_1$ДатаЗаключения

# Сортировка столбцов

GIS_PAGE_1 <- GIS_PAGE_1[c("DCODE",
                           "Договор на бумаге?",
                           "Договор", "ДатаЗаключения",
                           "Дата вступления в силу",
                           "Дата окончания действия",
                           "Вторая сторона договора",
                           "Тип лица", 
                           "Фамилия", 
                           "Имя", 
                           "Отчество", 
                           "Пол",
                           "Дата Рождения",
                           "СНИЛС", 
                           "Вид документа", 
                           "Номер документа", 
                           "Серия документа", 
                           "Дата выдачи",
                           "ОГРН",
                           "ИНН", 
                           "КПП", 
                           "Срок выставления", 
                           "Тип срока выставления", 
                           "Срок внесения платы",
                           "Тип срока платы",
                           "Срок информации о платежах",
                           "Тип срока о платежах", 
                           "Дата начала сдачи показаний ПУ",
                           "Следующего месяца?(начало)",
                           "Дата окончания сдачи показаний ПУ", 
                           "Следующего месяца?(конец)",
                           "Основание заключения", 
                           "Коммерческий учет ресурса осуществляет",
                           "Показатели качества КР",
                           "Объемы в договоре ?",
                           "ИдентификаторГИС")]

GIS_PAGE_1_NA_DELETED <- na.omit(GIS_PAGE_1)
test1 <-  GIS_PAGE_1 %>%
  select(Ссылка, ИдентификаторГИС) %>%
  filter(is.na(ИдентификаторГИС))

######################################################################################################
####################
######################################################################################################

# Страница "КУ и КР по ОЖФ"

# Отбор домов с отоплением для страницы 4
otoplenie_gisp4 <-  RCUO_objs %>%
  filter(HOUSE == "Жилой фонд", NOTOPP != 0)%>%
  select(DCODE, ADDRESS)%>%
  mutate("Номер квартиры" = "",
         "Номер комнаты" = "",
         "Коммунальная услуга" = "Отопление",
         "Коммунальный ресурс" = "Тепловая энергия",
         "Дата окончания" = "31.12.2030",
         "открытая/закрытая" = "Открытая",
         "Централизованная/нецентрализованная" = "Централизованная")

# отбор домов с открытой системой ГВС для страницы 4
gvs_gisp4_o <- RCUO_objs %>%
  filter(HOUSE == "Жилой фонд", SHEMA == "Открытая") %>%
  select(DCODE, ADDRESS)%>%
  mutate("Номер квартиры" = "",
         "Номер комнаты" = "",
         "Коммунальная услуга" = "Горячее водоснабжение",
         "Коммунальный ресурс" = "Тепловая энергия",
         "Дата окончания" = "31.12.2030",
         "открытая/закрытая" = "Открытая",
         "Централизованная/нецентрализованная" = "Централизованная")

gvs_gisp4_o_v <- RCUO_objs %>%
  filter(HOUSE == "Жилой фонд", SHEMA == "Открытая") %>%
  select(DCODE, ADDRESS)%>%
  mutate("Номер квартиры" = "",
         "Номер комнаты" = "",
         "Коммунальная услуга" = "Горячее водоснабжение",
         "Коммунальный ресурс" = "Теплоноситель",
         "Дата окончания" = "31.12.2030",
         "открытая/закрытая" = "Открытая",
         "Централизованная/нецентрализованная" = "Централизованная")



# отбор домов с закрытой системой ГВС для страницы 4
gvs_gisp4_z <- RCUO_objs %>%
  filter(HOUSE == "Жилой фонд", SHEMA == "Закрытая") %>%
  select(DCODE, ADDRESS)%>%
  mutate("Номер квартиры" = "",
         "Номер комнаты" = "",
         "Коммунальная услуга" = "Горячее водоснабжение",
         "Коммунальный ресурс" = "Тепловая энергия",
         "Дата окончания" = "31.12.2030",
         "открытая/закрытая" = "Закрытая",
         "Централизованная/нецентрализованная" = "Централизованная")

gvs_gisp4_z_v <- RCUO_objs %>%
  filter(HOUSE == "Жилой фонд", SHEMA == "Закрытая") %>%
  select(DCODE, ADDRESS)%>%
  mutate("Номер квартиры" = "",
         "Номер комнаты" = "",
         "Коммунальная услуга" = "Горячее водоснабжение",
         "Коммунальный ресурс" = "Теплоноситель",
         "Дата окончания" = "31.12.2030",
         "открытая/закрытая" = "Закрытая",
         "Централизованная/нецентрализованная" = "Централизованная")



# объединяем 5 таблиц в одну

binded_p4 <- as_data_frame(rbind(otoplenie_gisp4, gvs_gisp4_o, gvs_gisp4_z, gvs_gisp4_o_v, gvs_gisp4_z_v))
GIS_PAGE_4 <- merge(binded_p4, reqs[ ,c("Ссылка", "ДатаЗаключения")], by.x = "DCODE", by.y = "Ссылка", all.x = TRUE)
GIS_PAGE_4 <- GIS_PAGE_4[c("DCODE", "ADDRESS", "Номер квартиры", "Номер комнаты", "Коммунальная услуга", "Коммунальный ресурс",
                           "ДатаЗаключения", "Дата окончания", "открытая/закрытая", "Централизованная/нецентрализованная")]

######################################################################################################
####################
######################################################################################################

# Страница "Показатели качевства КР"


# отбор по отоплению
otop_gisp5 <- RCUO_objs %>%
  select(DCODE, NOTOPP) %>%
  group_by(DCODE) %>%
  summarise("Начало диапазона" = sum(NOTOPP),
            "Конец диапазона" = sum(NOTOPP)) %>%
  mutate("Адрес ОЖФ" = "",
         "Номер квартиры" = "", 
         "Номер комнаты" = "", 
         "Коммунальная услуга" = "Отопление",
         "Коммунальный ресурс" = "Тепловая энергия",
         "Показатель качества" = "Величина тепловой нагрузки",
         "Значение показателя" = "", 
         "Соответствует/не соответствует" = "", 
         "Код единицы измерения" = "238")

# отбор по гвс
gvs_gisp5 <- RCUO_objs %>%
  select(DCODE, NVODP) %>%
  group_by(DCODE) %>%
  summarise("Начало диапазона" = sum(NVODP),
            "Конец диапазона" = sum(NVODP)) %>%
  mutate("Адрес ОЖФ" = "", 
         "Номер квартиры" = "", 
         "Номер комнаты" = "", 
         "Коммунальная услуга" = "Горячее водоснабжение",
         "Коммунальный ресурс" = "Тепловая энергия",
         "Показатель качества" = "Величина тепловой нагрузки",
         "Значение показателя" = "", 
         "Соответствует/не соответствует" = "", 
         "Код единицы измерения" = "238")

# отбор по отоплению Диапазоны
otop_gisp5d <- RCUO_objs %>%
  select(DCODE, NOTOPP) %>%
  group_by(DCODE) %>%
  summarise("Значение показателя" = "") %>%
  mutate("Адрес ОЖФ" = "", 
         "Номер квартиры" = "",
         "Номер комнаты" = "", 
         "Коммунальная услуга" = "Отопление",
         "Коммунальный ресурс" = "Тепловая энергия", 
         "Показатель качества" = "Диапазон давления теплоносителя в подающем трубопроводе",
         "Начало диапазона" = "3,5", 
         "Конец диапазона" = "6", 
         "Соответствует/не соответствует" = "", 
         "Код единицы измерения" = "317")

# отбор по гвс Диапазоны
gvs_gisp5d <- RCUO_objs %>%
  select(DCODE, NVODP) %>%
  group_by(DCODE) %>%
  summarise("Значение показателя" = "") %>%
  mutate("Адрес ОЖФ" = "",
         "Номер квартиры" = "", 
         "Номер комнаты" = "", 
         "Коммунальная услуга" = "Горячее водоснабжение",
         "Коммунальный ресурс" = "Тепловая энергия", 
         "Показатель качества" = "Диапазон давления теплоносителя в подающем трубопроводе",
         "Начало диапазона" = "3,5", 
         "Конец диапазона" = "6", 
         "Соответствует/не соответствует" = "", 
         "Код единицы измерения" = "317")

# Объединяем 4 таблицы в одну

GIS_PAGE_5 <- as_data_frame(rbind(otop_gisp5, otop_gisp5d, gvs_gisp5, gvs_gisp5d))
GIS_PAGE_5 <- GIS_PAGE_5[c("DCODE",
                           "Адрес ОЖФ",
                           "Номер квартиры", 
                           "Номер комнаты", 
                           "Коммунальная услуга", 
                           "Коммунальный ресурс",
                           "Показатель качества", 
                           "Значение показателя", 
                           "Начало диапазона", 
                           "Конец диапазона",
                           "Соответствует/не соответствует",
                           "Код единицы измерения")]

######################################################################################################
####################
######################################################################################################

# Страница "Температурный график" последняя

GIS_PAGE_7 <-  RCUO_objs %>%
  select(DCODE) %>%
  distinct(DCODE, .keep_all = TRUE) %>%
  mutate("Адрес ОЖФ" = "",
        "Номер квартиры" = "",
        "Номер комнаты" = "",
        "Температура наружного воздуха" = "-22",
        "Температура подачи" = "115",
        "Температура обратки" = "70")

# Запись в эксель

write.csv(GIS_PAGE_1, file = "D:/R/scripts/гис/p1.csv")
write.csv(GIS_PAGE_2, file = "D:/R/scripts/гис/p2.csv")
write.csv(GIS_PAGE_3, file = "D:/R/scripts/гис/p3.csv")
write.csv(GIS_PAGE_4, file = "D:/R/scripts/гис/p4.csv")
write.csv(GIS_PAGE_5, file = "D:/R/scripts/гис/p5.csv")
write.csv(GIS_PAGE_7, file = "D:/R/scripts/гис/p7.csv")
